results/results_c5_large/results_c5_large_run2/oltp_read_write_t4/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 51.59 qps: 1036.33 (r/w/o: 725.98/57.59/252.76) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 58.70 qps: 1175.73 (r/w/o: 823.12/63.80/288.81) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 57.90 qps: 1157.00 (r/w/o: 809.70/64.70/282.60) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 57.30 qps: 1145.50 (r/w/o: 802.40/63.70/279.40) lat (ms,95%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 49.20 qps: 980.80 (r/w/o: 685.70/55.20/239.90) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 57.50 qps: 1152.80 (r/w/o: 807.70/63.40/281.70) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4 tps: 57.80 qps: 1155.40 (r/w/o: 808.30/64.70/282.40) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4 tps: 52.50 qps: 1050.30 (r/w/o: 735.60/59.40/255.30) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 56.80 qps: 1136.70 (r/w/o: 795.90/63.60/277.20) lat (ms,95%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 58.30 qps: 1167.20 (r/w/o: 816.60/63.80/286.80) lat (ms,95%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 4 tps: 56.30 qps: 1123.50 (r/w/o: 786.50/63.40/273.60) lat (ms,95%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 4 tps: 50.10 qps: 1002.90 (r/w/o: 701.90/55.90/245.10) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            93016
        write:                           7396
        other:                           32468
        total:                           132880
    transactions:                        6644   (55.32 per sec.)
    queries:                             132880 (1106.45 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      55.3225
    time elapsed:                        120.0958s
    total number of events:              6644

Latency (ms):
         min:                                   29.51
         avg:                                   72.27
         max:                                  417.20
         95th percentile:                      132.49
         sum:                               480177.43

Threads fairness:
    events (avg/stddev):           1661.0000/10.75
    execution time (avg/stddev):   120.0444/0.03